Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotPasteRoomsInNonPlanViews Property
 [Rooms] can only be pasted in Plan or Ceiling Plan views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPasteRoomsInNonPlanViews { get; }
Visual Basic
Public Shared ReadOnly Property CannotPasteRoomsInNonPlanViews As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPasteRoomsInNonPlanViews {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace